{
    "text": "When former President Donald Trump held a campaign event at Arlington National Cemetery last week, 1st Lt. Jimmy McCain says he viewed it as a “violation.”\n\nThe youngest son of the late Sen. John McCain had already been moving away from the Republican Party — just weeks ago, he changed his voter registration to Democrat and plans to vote for Kamala Harris in November, he told CNN in an exclusive interview this week.\n\nBut he is speaking out now for the first time about Trump because of the former president’s conduct at the hallowed ground where several generations of McCain’s family, including his grandfather and great grandfather, are buried.\n\n“It just blows me away,” McCain, who has served in the military for 17 years, told CNN. “These men and women that are laying in the ground there have no choice” of whether to be a backdrop for a political campaign, he said.\n\n“I just think that for anyone who’s done a lot of time in their uniform, they just understand that inherently — that it’s not about you there. It’s about these people who gave the ultimate sacrifice in the name of their country.”\n\nMcCain’s decision to speak out now is part of his broader shift away from the Republican Party and his family’s famously conservative roots. After years as a registered independent, he says he registered as a Democrat several weeks ago and plans to vote for Kamala Harris in November, adding that he “would get involved in any way I could” to help her campaign.\n\nIt’s a significant move for the son of a former GOP presidential candidate and Arizona senator. While other members of the McCain family have distanced themselves from Trump — including Jimmy McCain’s mother Cindy, who endorsed then-candidate Joe Biden in 2020, and his sister Meghan — none except Jimmy have publicly abandoned the Republican Party.\n\nDespite her harsh criticisms of Trump, Meghan McCain indicated last week that she would still not endorse Harris. “I’m a lifelong, generational conservative,” she tweeted.\n\nJimmy McCain, who enlisted in the Marine Corps at age 17 and now serves as an intelligence officer in the 158th Infantry Regiment, had until now deliberately sought to avoid entering the political fray. Trump’s attacks on his father — that he was “not a war hero” because he was captured in Vietnam, and his reported description of the elder McCain as a “loser” — were deeply hurtful on a personal level, but not out of bounds politically, Jimmy McCain believes.\n\n“One thing about John McCain is that he chose a public life,” McCain said. “So to attack him is really not out of the realm of his job description.”\n\nFor the younger McCain, though, the Arlington episode and how the campaign has reacted to it represents a whole new level of what he perceives as Trump’s disrespect for the fallen. And he believes it stems from Trump’s own insecurities about not having served.\n\n“Many of these men and women, who served their country, chose to do something greater than themselves,” McCain said. “They woke up one morning, they signed on the dotted line, they put their right hand up, and they chose to serve their country. And that’s an experience that Donald Trump has not had. And I think that might be something that he thinks about a lot.”\n\nMcCain emphasized that he is speaking on his own behalf and his views do not represent those of the US Army. McCain received his commission and became an officer in US Army intelligence in 2022.\n\nMcCain’s anger over the Arlington episode was also particularly acute because when it happened, he had just returned from a seven-month deployment to a small US base on the Jordan-Syria border known as Tower 22.\n\nHe arrived there just weeks after three US service members were killed on the base in a drone attack by Iran-backed militants, and he says he thought of them when he saw Trump posing last Monday in front of gravestones.\n\n“It was a violation,” McCain said. “That mother, that sister, those families, see that — and it’s a painful experience.”\n\nTrump visited the cemetery last Monday following a wreath laying ceremony honoring the 13 US military service members who were killed at Kabul airport’s Abbey Gate in Afghanistan in 2021. His campaign filmed the visit, leading to an altercation with a cemetery staffer who attempted to prevent Trump’s team from photographing and filming in the area where recent US casualties are buried. According to the Army, doing so violates federal law, Army regulations and Defense Department policies.\n\nTrump is not the first politician to violate a ban on political activity at Arlington. In fact, more than 20 years ago, John McCain said he made “a very bad mistake” when he released a campaign ad that featured a clip of him walking through the cemetery.\n\nTrump and his campaign, however, have not issued such a mea culpa. Instead, according to the US Army, they ignored and “abruptly pushed aside” a cemetery staffer who protested the activity and published footage of the event later anyway. One of Trump’s campaign managers, Chris LaCivita, called the Army “hacks” and said it was “100% a manufactured story.”\n\nOver the weekend, Trump’s campaign released taped statements from family members of some of the service members who were killed at Abbey Gate, who said they invited Trump to their loved ones’ graves. But the campaign’s video of the event, which they put on TikTok, showed other gravestones, too — including that of an Army Special Forces soldier who died by suicide, and whose family said they did not give the campaign permission to film it.\n\nMcCain, for his part, is now bracing to get more involved in this election cycle. While he has been involved in veteran advocacy work for years, he acknowledges that his own recent political shift has been deeply personal.'}\n\n“John McCain was my father, and a lot of people lose that in the minutia,” McCain said. “He wasn’t ‘John McCain’ the way he is to the world. He was the man who loved me. And the one thing I’ve known about my dad since the moment I could think, was that he was a good man and that he had done his part. And for me to be with him towards the end of his life, hearing things [from Trump] like, he was a loser because he was captured—I don’t think I could ever overlook that.\n"
}